In [2]:
import pandas as pd
obj = pd.Series([4,7,-5,3])  # 一维数组  
print(obj)
print(obj.index)             # 下标
print(obj.values)            # 值

0    4
1    7
2   -5
3    3
dtype: int64
RangeIndex(start=0, stop=4, step=1)
[ 4  7 -5  3]

In [9]:
obj2 = pd.Series([4,7,-5,3], index=['a','b','c','d'])
print(obj2)
print(obj2[obj2>0])   # 过滤掉一些数据  
print('b' in obj2)    # cf: 这种写法只针对索引 index  而不针对values

a    4
b    7
c   -5
d    3
dtype: int64
a    4
b    7
d    3
dtype: int64
True
False

In [17]:
sdata = {'Ohio':35000, 'Texas':4343, 'Oregon':3432, 'Utah':5000}
obj3=pd.Series(sdata)
print(obj3)  #  它自动排列了  按照索引的字母来排序的的
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4=pd.Series(sdata, index=states)   # 顺序指定
print(obj4)
print(pd.isnull(obj4))    # 是否为空
print(pd.notnull(obj4))   # 是否不为空

Ohio      35000
Oregon     3432
Texas      4343
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon         3432.0
Texas          4343.0
dtype: float64
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
print(obj3)
print(obj4)
print(obj3 + obj4)  # 一个重要的功能  它能根据索引自动更新数据

Ohio      35000
Oregon     3432
Texas      4343
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon         3432.0
Texas          4343.0
dtype: float64
California        NaN
Ohio          70000.0
Oregon         6864.0
Texas          8686.0
Utah              NaN
dtype: float64

In [22]:
obj4.name='population'    # 每个Series都有个name和index.name属性，可以看做是表名 索引总名
obj4.index.name='state' 
obj4

state
California        NaN
Ohio          35000.0
Oregon         3432.0
Texas          4343.0
Name: population, dtype: float64

In [7]:
#======================漂亮的分割线============================#
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002, 2003],
        'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame      # 在jupyter notebook 上显示甚是好看   如果是frame.head  会取前5个显示

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [28]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [8]:
frame2=pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2    # 如果没有则自动补全为NaN  Not a Number

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [32]:
frame2['state']   # 取一列

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.year   # 表转化成 DataFrame的属性了

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [34]:
frame2.loc['three']   # 取一行

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
frame2['debt']=16.5   # 会给Series全部赋一个值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [5]:
import numpy as np
frame2['debt']=np.arange(6.)   # 把numpy生成集合赋值给一个Series
frame2

NameError: name 'frame2' is not defined

In [39]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [40]:
frame2['eastern'] = frame2['state']=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [43]:
del frame2['eastern']    # 不能用 frame.eastern 这样的    综上所述  还是用传统比较好 
print(frame2.columns)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [3]:
pop = {'Nevada':{2001:2.4,2002: 2.9}, 'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
frame3 = pd.DataFrame(pop)  # 嵌套字典  =》外层字典的键作为列，内层键则作为行索引
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [47]:
frame3.T   # 转置   二维表沿着正对角线顺时针旋转180°

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [48]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [50]:
pdata={'Ohio':frame3['Ohio'][:-1], 'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [9]:
frame3.index.name='year'; frame3.columns.name='state'    # 设定行列名称
print(frame3)
print(frame3.values)   # 二维表的内容 
print(frame3.columns)

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
[[ nan  1.5]
 [ 2.4  1.7]
 [ 2.9  3.6]]
Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [10]:
dup_labels = pd.Index(['foo','foo','bar','bar'])   # 索引还可以重复的
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [14]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])
print(obj)
obj2 = obj.reindex(['a','b','c','d','e'])   # 重新对索引进行排序
print(obj2)

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [17]:
obj3 = pd.Series(['blue', 'purple','yellow'], index=[0,2,4])
print(obj3)
obj3_ffill = obj3.reindex(range(6), method='ffill')  # 向前值填充
print(obj3_ffill)

0      blue
2    purple
4    yellow
dtype: object
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [21]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['Ohio', 'Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [22]:
frame2 = frame.reindex(['a','b','c','d'])  # 缺省值用NaN代替   Not  a  Number
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [23]:
states = ['Texas', 'California', 'Ohio']
frame3 = frame2.reindex(columns=states)
frame3

   Texas  California  Ohio
a    1.0         2.0   0.0
b    NaN         NaN   NaN
c    4.0         5.0   3.0
d    7.0         8.0   6.0

In [26]:
obj = pd.Series(np.arange(5), index=['a','b','c','d','e'])
new_obj = obj.drop('c')    # 丢弃 删除  index='c' 的元素
new_obj = obj.drop(['d','c'])  # 丢弃 多个

a    0
b    1
e    4
dtype: int64

In [27]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','California','Utah','New York'], columns=['one', 'two','three','four'])
data

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [28]:
data.drop(['California', 'Ohio'])  # 删除行  默认asix=0

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data.drop(['one', 'two'], axis=1)

            three  four
Ohio            2     3
California      6     7
Utah           10    11
New York       14    15

In [32]:
data.drop(['one', 'two'], axis='columns')  # axis中的  1=columns   那么行呢  0=？

            three  four
Ohio            2     3
California      6     7
Utah           10    11
New York       14    15

In [34]:
data.drop(['California', 'Ohio'],axis='index')    # 当然是 0=index 属性名称  对应起来的

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [41]:
obj = pd.Series(np.arange(4), index=['a','b','c','d'])
print(obj)
print(obj['c'])
print(obj[2])

a    0
b    1
c    2
d    3
dtype: int64
2
2

In [43]:
print(obj[2:4])
print(obj[['b','a','d']])
print(obj[[1,3]])
print(obj[obj<2])

c    2
d    3
dtype: int64
b    1
a    0
d    3
dtype: int64
b    1
d    3
dtype: int64
a    0
b    1
dtype: int64

In [45]:
print(obj['b':'c'])   # 这样也行  太随便了  太灵活了 
obj['b':'c']=5
obj

b    1
c    2
dtype: int64

a    0
b    5
c    5
d    3
dtype: int64

In [46]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','California','Utah','New York'], columns=['one', 'two','three','four'])
data

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [49]:
data[['two','one']]

            two  one
Ohio          1    0
California    5    4
Utah          9    8
New York     13   12

In [51]:
data[:2]   # 这里比较奇怪  不以表名做筛选条件  而是列 其实想想也对  在数据库中  表是没有先后顺序的  
           # 那么传进去是表名  是整数或者整数数组就是表名

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7

In [53]:
data[data['three']>5]  # 通过列进行筛选   得到行

            one  two  three  four
California    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [54]:
data<5

              one    two  three   four
Ohio         True   True   True   True
California   True  False  False  False
Utah        False  False  False  False
New York    False  False  False  False

In [59]:
data[data<5]=0
data

            one  two  three  four
Ohio          0    0      0     0
California    0    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [61]:
# 选择行和列的子集的工具   轴标签loc  整数索引 iloc      loc传进去的是字符串  而iloc是整数   难怪有个i 代表int
data.loc['California', ['two','three']]   # 第一个参数是索引名称  第二个是表名

two      5
three    6
Name: California, dtype: int64

In [62]:
data.iloc[2,[3,0,1]]         # 第一个参数是索引序列  第二个是表的序列

four    11
one      8
two      9
Name: Utah, dtype: int64

In [63]:
data.loc[['California','Ohio'], ['two','three']]

            two  three
California    5      6
Ohio          0      0

In [64]:
data.iloc[[2,1],[3,0,1]]

            four  one  two
Utah          11    8    9
California     7    0    5

In [71]:
data.iloc[:,:3][data.three>5]   #拆开看 data.iloc[:,:3]  + [data.three>5]

            one  two  three
California    0    5      6
Utah          8    9     10
New York     12   13     14

In [78]:
ser = pd.Series(np.arange(3.))
# print(ser)
# print(ser[-1])   #会报错
ser2 = pd.Series(np.arange(3), index=['a','b','c'])
print(ser2)
print(ser2[-1])  #  但是非整数索引是可以的  我猜还有个默认的索引 是整数  或许改源码可以解决这个问题

a    0
b    1
c    2
dtype: int64
2

In [79]:
ser[:1]

0    0.0
dtype: float64

In [80]:
ser.loc[:1]   # 包括

0    0.0
1    1.0
dtype: float64

In [81]:
ser.iloc[:1]

0    0.0
dtype: float64

In [83]:
# pandas 最重要的一个功能  对不同索引的对象进行算术运算   像数据的外连接
s1 = pd.Series([7.3, -2.5, 3.4, 1.5],     index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c',      'e', 'f', 'g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [86]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),  index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(df1)
print(df2)
df1 + df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [88]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3.4]})
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [90]:
# 填充默认值
df1= pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2= pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2.loc[1,'b']=np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [91]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [92]:
df1+df2   # 普通的加  没有重叠的 产生 NA值

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [93]:
df1.add(df2, fill_value=0)   # 这样就有了默认值 fill_value=0   但是不知道其他操作都有没有默认值

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [94]:
df1.reindex(columns=df2.columns, fill_value=0)  # 在重新索引时也可以指定一个填充值

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [95]:
# DataFrame和Series之间的运算
arr= np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [97]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [98]:
frame = pd.DataFrame(np.arange(12).reshape(4,3), columns=list('bde'), index=['Utah','Ohio','Texas','Oregon'])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [100]:
series=frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int64

In [101]:
frame - series   # 和 numpy中类似  广播  传递

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [102]:
series2 = pd.Series(range(3), index=['b','e','f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [104]:
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int64

In [105]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [106]:
frame.sub(series3, axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [15]:
# 函数应用和映射
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.777685 -1.690127 -0.493588
Ohio   -0.892986  0.235210 -0.931015
Texas  -1.109047 -0.265363 -1.254102
Oregon -1.402349 -0.440004  1.086610

In [108]:
np.abs(frame)   # 还可以这样操作  用numpy操作pandas对象

               b         d         e
Utah    0.052123  0.827638  1.156738
Ohio    0.340305  0.845315  2.096093
Texas   0.899175  0.312861  1.459717
Oregon  1.341706  0.206324  0.787261

In [113]:
f = lambda x: x.max() - x.min()
frame.apply(f,axis='index')  # columns

b    2.240881
d    0.638990
e    3.555810
dtype: float64

In [114]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max']) # 自己写不出来  但是看得懂系列   需要练习
frame.apply(f)

            b         d         e
min -0.899175 -0.845315 -1.459717
max  1.341706 -0.206324  2.096093

In [18]:
import numpy as np
import pandas as pd
formats = lambda x: '%.2f' % x   # 把原本6位小数转化成2位 
print(frame)
print(frame.applymap(formats))

               b         d         e
Utah    1.777685 -1.690127 -0.493588
Ohio   -0.892986  0.235210 -0.931015
Texas  -1.109047 -0.265363 -1.254102
Oregon -1.402349 -0.440004  1.086610
            b      d      e
Utah     1.78  -1.69  -0.49
Ohio    -0.89   0.24  -0.93
Texas   -1.11  -0.27  -1.25
Oregon  -1.40  -0.44   1.09

In [19]:
frame['e'].map(formats)    # 但是为什么可以这样写  和迭代器有很大的关系吗？

Utah      -0.49
Ohio      -0.93
Texas     -1.25
Oregon     1.09
Name: e, dtype: object

In [21]:
# 排序
obj = pd.Series(range(4), index=['d','a','b','c'])
#obj.sort_index()  对索引排列
obj.sort_values()  # 对值进行排序

d    0
a    1
b    2
c    3
dtype: int64

In [22]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),
                    index=['three','one'],
                    columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [37]:
frame.sort_index(axis=0, ascending=True)  # 0 代表对列排列  1 代表对行排列   ascending代表是否降序

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [38]:
frame = pd.DataFrame({'b':[4,7,-3,-2], 'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1 -2

In [43]:
frame.sort_values(by=['a','b'], ascending=True)

   a  b
2  0 -3
0  0  4
3  1 -2
1  1  7

In [44]:
# 好玩的排列方式   rank()   method='first', 'max'...
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank()  # 例如俩个7是6和7位，取平均值

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [45]:
obj.rank(method='first')  # 这就是正常的操作

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [47]:
obj.rank(method='max', ascending=True) # 取后面的  往后

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [49]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2], 'a':[0,1,0,1], 'c':[-2,5,8,-2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [53]:
frame.rank(axis='columns')   # 按照行来操作

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [57]:
# 带有重复标签的轴索引
obj = pd.Series(range(5), index=['a','a','b','b','c'])
print(obj.index.is_unique)   # 是否唯一

False

In [66]:
df=pd.DataFrame([[np.nan,1.4],[7.1, -4.5],[np.nan,np.nan],[0.75,-1.3]], index=['a','b','c','d'], columns=['one','two'])
df

    one  two
a   NaN  1.4
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [68]:
df.sum(axis=1, skipna=False)  # 如果skipna=False 那么遇到NaN都会变成NaN

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [72]:
df.idxmax(axis=0)  # 默认是以表来排的

one    b
two    a
dtype: object

In [73]:
df.cumsum()    # 累加

    one  two
a   NaN  1.4
b  7.10 -3.1
c   NaN  NaN
d  7.85 -4.4

In [74]:
df.describe()

            one       two
count  2.000000  3.000000
mean   3.925000 -1.466667
std    4.490128  2.953529
min    0.750000 -4.500000
25%    2.337500 -2.900000
50%    3.925000 -1.300000
75%    5.512500  0.050000
max    7.100000  1.400000

In [3]:
# 相关系数 和  协方差 
import pandas as pd
import pandas_datareader.data as web
all_data = {ticker : web.get_data_yahoo(ticker)  for ticker       in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']    for ticker, data in all_data.items()})
returns = price.pct_change()
returns.tail()   # 计算价格百分数变化
#  这部分暂时不管 数据没得  只是很简单的探索  后面还有无边大海呢

                AAPL      GOOG       IBM      MSFT
Date
2018-04-05  0.006934  0.002605 -0.000584  0.000541
2018-04-06 -0.025579 -0.020208 -0.022463 -0.023273
2018-04-09  0.009918  0.008351  0.014080  0.005985
2018-04-10  0.018818  0.015944  0.017683  0.023246
2018-04-11 -0.004098 -0.011996 -0.008430 -0.005814

In [4]:
#   唯一值   值计数   成员资格?  
import pandas as pd
obj = pd.Series(['c', 'a','d','a','a','b','b','c','c'])
uniques = obj.unique()